docs/spec/grammar.org
#+TITLE: Prologos Language Grammar
#+SUBTITLE: A Literate Specification of the Surface Syntax
#+AUTHOR: Prologos Project
#+DATE: 2026-02-21
#+OPTIONS: toc:3 num:t
#+PROPERTY: header-args :eval no

* Introduction

Prologos is a functional-logic language unifying dependent types, session types,
linear types (QTT), logic programming, and propagators. This document describes
the /surface syntax/ of the language as written in =.prologos= files.

Prologos has two syntactic modes:

1. *Whitespace-sensitive mode* (=.prologos= files): Indentation-based structure
   with =[]= for grouping and minimal punctuation. This is the primary mode.
2. *S-expression mode*: Parenthesized fallback for use in macros, tests, and
   when embedding in Racket. Every WS-mode form has a canonical sexp
   representation.

The grammar is organized bottom-up: lexical elements, then types, then
expressions, then declarations.

#+begin_quote
*Design Principle*: Prologos is /homoiconic/ --- code and data share the same
representation. All syntactic sugar desugars to s-expressions. Macros operate on
the post-parse representation, making code-as-data a first-class concept.
#+end_quote

* Lexical Grammar

** Comments

Line comments begin with =;= and extend to end of line. There are no block
comments.

#+begin_src prologos
;; This is a comment
def x : Nat zero  ; inline comment
#+end_src

** Identifiers

Identifiers may contain letters, digits, hyphens, question marks, exclamation
marks, and primes. They must not start with a digit.

#+begin_src grammar
identifier  ::= ident-start { ident-char }
ident-start ::= letter | '_' | '+' | '*' | '/' | '!' | '?' | '<' | '>' | '='
ident-char  ::= ident-start | digit | '-' | "'"
#+end_src

Naming conventions:
- Predicates use =?= suffix: =zero?=, =empty?=, =member?=
- Destructive operations use =!= suffix: =persist!=, =tvec-push!=
- Type names are capitalized: =Nat=, =List=, =Option=
- Value names are lowercase with hyphens: =sort-on=, =find-index=

Qualified names use =::= separator:

#+begin_src prologos
list::map       ;; qualified reference to list module's map
nat::add        ;; qualified reference to nat module's add
opt::unwrap-or  ;; qualified reference to option module's unwrap-or
#+end_src

** Numeric Literals

Prologos has four numeric literal forms:

#+begin_src grammar
nat-literal    ::= digit+ 'N'           (* Natural: 0N, 42N, 100N *)
int-literal    ::= ['-'] digit+         (* Integer: 42, -7, 0     *)
rat-literal    ::= ['-'] digit+ '/' digit+  (* Rational: 3/7, -1/3 *)
approx-literal ::= '~' (int | rat)      (* Posit approx: ~42, ~3/7 *)
#+end_src

#+begin_src prologos
42N          ;; Nat literal (Church-encoded natural)
42           ;; Int literal (arbitrary-precision integer)
3/7          ;; Rat literal (exact rational)
~3/7         ;; approximate Posit literal
#+end_src

** String Literals

Double-quoted with standard escape sequences (=\n=, =\t=, =\\=, =\"=).

#+begin_src prologos
"hello world"
"line one\nline two"
#+end_src

** Keyword Literals

Keywords start with =:= and are used as map keys and enum-like values:

#+begin_src prologos
:name
:age
:hello
#+end_src

** Boolean Literals

#+begin_src prologos
true
false
#+end_src

** Special Tokens

| Token     | Meaning                                      |
|-----------+----------------------------------------------|
| =_=       | Wildcard / type hole (inferred)              |
| =_1= =_2= | Numbered placeholders for partial application |
| =:0=      | Erased multiplicity (use 0 times)            |
| =:1=      | Linear multiplicity (use exactly 1 time)     |
| =:w=      | Unrestricted multiplicity (use any times)    |
| =zero=    | Nat zero constructor                         |
| =unit=    | Unit value                                   |
| =refl=    | Equality reflexivity proof                   |

