docs/spec/grammar.tex
% Created 2026-02-21 Sat 10:34
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{The Prologos Project — from Zachary Larson}
\date{2026-02-21}
\title{Prologos Language Grammar\\\medskip
\large A Literate Specification of the Surface Syntax}
\hypersetup{
 pdfauthor={The Prologos Project — from Zachary Larson},
 pdftitle={Prologos Language Grammar},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.39)}, 
 pdflang={English}}
\begin{document}

\maketitle
\setcounter{tocdepth}{3}
\tableofcontents

\section{Introduction}
\label{sec:org53cf472}

Prologos is a functional-logic language unifying dependent types, session types,
linear types (QTT), logic programming, and propagators. This document describes
the \emph{surface syntax} of the language as written in \texttt{.prologos} files.

Prologos has two syntactic modes:

\begin{enumerate}
\item \textbf{Whitespace-sensitive mode} (\texttt{.prologos} files): Indentation-based structure
with \texttt{[]} for grouping and minimal punctuation. This is the primary mode.
\item \textbf{S-expression mode}: Parenthesized fallback for use in macros, tests, and
when embedding in Racket. Every WS-mode form has a canonical sexp
representation.
\end{enumerate}

The grammar is organized bottom-up: lexical elements, then types, then
expressions, then declarations.

\begin{quote}
\textbf{Design Principle}: Prologos is \emph{homoiconic} --- code and data share the same
representation. All syntactic sugar desugars to s-expressions. Macros operate on
the post-parse representation, making code-as-data a first-class concept.
\end{quote}
\section{Lexical Grammar}
\label{sec:org3c7e7f7}

\subsection{Comments}
\label{sec:orgb42c5f6}

Line comments begin with \texttt{;} and extend to end of line. There are no block
comments.

\begin{verbatim}
;; This is a comment
def x : Nat zero  ; inline comment
\end{verbatim}
\subsection{Identifiers}
\label{sec:orge6bed86}

Identifiers may contain letters, digits, hyphens, question marks, exclamation
marks, and primes. They must not start with a digit.

\begin{verbatim}
identifier  ::= ident-start { ident-char }
ident-start ::= letter | '_' | '+' | '*' | '/' | '!' | '?' | '<' | '>' | '='
ident-char  ::= ident-start | digit | '-' | "'"
\end{verbatim}

Naming conventions:
\begin{itemize}
\item Predicates use \texttt{?} suffix: \texttt{zero?}, \texttt{empty?}, \texttt{member?}
\item Destructive operations use \texttt{!} suffix: \texttt{persist!}, \texttt{tvec-push!}
\item Type names are capitalized: \texttt{Nat}, \texttt{List}, \texttt{Option}
\item Value names are lowercase with hyphens: \texttt{sort-on}, \texttt{find-index}
\end{itemize}

Qualified names use \texttt{::} separator:

\begin{verbatim}
list::map       ;; qualified reference to list module's map
nat::add        ;; qualified reference to nat module's add
opt::unwrap-or  ;; qualified reference to option module's unwrap-or
\end{verbatim}
\subsection{Numeric Literals}
\label{sec:orge1ec826}

Prologos has four numeric literal forms:

\begin{verbatim}
nat-literal    ::= digit+ 'N'           (* Natural: 0N, 42N, 100N *)
int-literal    ::= ['-'] digit+         (* Integer: 42, -7, 0     *)
rat-literal    ::= ['-'] digit+ '/' digit+  (* Rational: 3/7, -1/3 *)
approx-literal ::= '~' (int | rat)      (* Posit approx: ~42, ~3/7 *)
\end{verbatim}

\begin{verbatim}
42N          ;; Nat literal (Church-encoded natural)
42           ;; Int literal (arbitrary-precision integer)
3/7          ;; Rat literal (exact rational)
~3/7         ;; approximate Posit literal
\end{verbatim}
\subsection{String Literals}
\label{sec:org505ba23}

Double-quoted with standard escape sequences (\texttt{\textbackslash{}n}, \texttt{\textbackslash{}t}, \texttt{\textbackslash{}\textbackslash{}}, \texttt{\textbackslash{}"}).

\begin{verbatim}
"hello world"
"line one\nline two"
\end{verbatim}
\subsection{Keyword Literals}
\label{sec:org473cd3e}

Keywords start with \texttt{:} and are used as map keys and enum-like values:

\begin{verbatim}
:name
:age
:hello
\end{verbatim}
\subsection{Boolean Literals}
\label{sec:org31105d7}

\begin{verbatim}
true
false
\end{verbatim}
\subsection{Special Tokens}
\label{sec:org6aa18fc}

\begin{center}
\begin{tabular}{ll}
Token & Meaning\\
\hline
\texttt{\_} & Wildcard / type hole (inferred)\\
\texttt{\_1} \texttt{\_2} & Numbered placeholders for partial application\\
\texttt{:0} & Erased multiplicity (use 0 times)\\
\texttt{:1} & Linear multiplicity (use exactly 1 time)\\
\texttt{:w} & Unrestricted multiplicity (use any times)\\
\texttt{zero} & Nat zero constructor\\
\texttt{unit} & Unit value\\
\texttt{refl} & Equality reflexivity proof\\
\end{tabular}
\end{center}
