docs/spec/grammar.org
** Bracket Types

Prologos uses four bracket types, each with distinct semantics:

| Brackets | Purpose                                         |
|----------+-------------------------------------------------|
| =[...]=  | Primary grouping: function application, params  |
| =(...)=  | Special forms: =(fn ...)=, =(match ...)=, types |
| ={...}=  | Implicit type parameters, map literals           |
| =<...>=  | Dependent types, return type annotations          |

Inside any bracket pair, newlines are treated as whitespace (indentation is not
significant).

** Collection Literal Prefixes

| Syntax    | Type             | Example         |
|-----------+------------------+-----------------|
| ='[...]=  | =List=           | ='[1N 2N 3N]=  |
| =@[...]=  | =PVec=           | =@[1 2 3]=     |
| =~[...]=  | =LSeq=           | =~[1 2 3]=     |
| =#{...}=  | =Set=            | =#{1 2 3}=     |
| ={k v}=   | =Map=            | ={:name "Ada"}= |

* Type Expressions

In a dependently-typed language, types and terms share the same expression
syntax. This section highlights type-specific forms.

** Base Types

#+begin_src grammar
base-type ::= 'Type'     (* universe of types, level inferred *)
            | 'Nat'      (* natural numbers                    *)
            | 'Int'      (* arbitrary-precision integers        *)
            | 'Rat'      (* exact rationals                     *)
            | 'Bool'     (* booleans                            *)
            | 'Unit'     (* unit type                           *)
            | 'Symbol'   (* symbols for homoiconicity           *)
            | 'Keyword'  (* keyword type for map keys           *)
            | 'Datum'    (* code-as-data algebraic type         *)
#+end_src

#+begin_src prologos
def x : Nat zero
def b : Bool true
def u : Unit unit
#+end_src

** Parameterized Types

Types are applied to arguments via juxtaposition in brackets:

#+begin_src prologos
List Nat            ;; list of natural numbers
Option Bool         ;; optional boolean
Map Keyword Int     ;; keyword-to-int map
Vec Nat 3N          ;; length-3 vector of Nats (dependent!)
Set Int             ;; set of ints
PVec Nat            ;; persistent vector of Nats
#+end_src

** Function Types (Arrows)

Arrows are right-associative infix operators:

#+begin_src grammar
arrow-type ::= type '->' type    (* unrestricted function *)
             | type '-0>' type   (* erased function       *)
             | type '-1>' type   (* linear function       *)
             | type '-w>' type   (* unrestricted, explicit *)
#+end_src

#+begin_src prologos
Nat -> Nat                ;; simple function
Nat -> Nat -> Bool        ;; curried: Nat -> (Nat -> Bool)
[List A] -> Nat           ;; bracketed domain
[A -> B] -> [List A] -> List B  ;; higher-order
#+end_src

** Dependent Types (Angle Brackets)

Angle brackets delimit dependent Pi (universal) and Sigma (existential) types:

#+begin_src grammar
dependent-type ::= '<' '(' ident ':' type ')' '->' type '>'  (* dependent Pi   *)
                 | '<' '(' ident ':' type ')' '*'  type '>'  (* dependent Sigma *)
                 | '<' ident ':' type '->' type '>'           (* shorthand Pi   *)
#+end_src

#+begin_src prologos
;; Dependent function: "for all n : Nat, a vector of length n"
<(n : Nat) -> Vec Nat n>

;; Dependent pair: "a natural n together with a Vec of that length"
<(n : Nat) * Vec Nat n>

;; Shorthand (single binder, no inner parens):
<n : Nat -> Vec Nat n>
#+end_src

** Sigma Types (Product / Pair Types)

Non-dependent pair types use infix =*=:

#+begin_src prologos
;; Non-dependent pair
Nat * Bool

;; In return type of split-at:
[Sigma [_ <List A>] [List A]]

;; Dependent Sigma via angle brackets:
<(x : Nat) * Vec Nat x>
#+end_src

** Equality Type

#+begin_src prologos
;; Eq type : proof that two terms are equal
(Eq Nat zero zero)       ;; 0 = 0 at type Nat
(Eq Nat [add x y] [add y x])  ;; commutativity
#+end_src

** Union Types

Union types use infix =|=:

#+begin_src prologos
Nat | Bool         ;; either a Nat or a Bool
Int | Rat | Nat    ;; right-associative: Int | (Rat | Nat)
#+end_src

** Universe Levels

#+begin_src prologos
Type           ;; universe, level inferred
(Type 0)       ;; explicit level 0
(Type 1)       ;; explicit level 1 (contains Type 0)
#+end_src

** Type Holes

The wildcard =_= stands for an inferred type:

#+begin_src prologos
def x : _ zero    ;; type inferred as Nat
map _ xs          ;; type argument inferred
#+end_src

* Expressions

** Function Application

Application is juxtaposition, with brackets =[]= for grouping:

#+begin_src prologos
;; Simple application
suc zero                    ;; suc(zero)

;; Multi-argument (uncurried convention)
add x y                     ;; add(x, y)

;; Brackets for grouping
[add x y]                   ;; same as add x y
cons [f a] [map f as]       ;; cons(f(a), map(f, as))

;; Nested application
map [add 1N _] '[1N 2N 3N]  ;; map with partial application
#+end_src

