docs/spec/grammar.tex
\subsection{Bracket Types}
\label{sec:orgf06dbf1}

Prologos uses four bracket types, each with distinct semantics:

\begin{center}
\begin{tabular}{ll}
Brackets & Purpose\\
\hline
\texttt{[...]} & Primary grouping: function application, params\\
\texttt{(...)} & Special forms: \texttt{(fn ...)}, \texttt{(match ...)}, types\\
\texttt{\{...\}} & Implicit type parameters, map literals\\
\texttt{<...>} & Dependent types, return type annotations\\
\end{tabular}
\end{center}

Inside any bracket pair, newlines are treated as whitespace (indentation is not
significant).
\subsection{Collection Literal Prefixes}
\label{sec:org1c9a28f}

\begin{center}
\begin{tabular}{lll}
Syntax & Type & Example\\
\hline
\texttt{'[...]} & \texttt{List} & \texttt{'[1N 2N 3N]}\\
\texttt{@[...]} & \texttt{PVec} & \texttt{@[1 2 3]}\\
\texttt{\textasciitilde{}[...]} & \texttt{LSeq} & \texttt{\textasciitilde{}[1 2 3]}\\
\texttt{\#\{...\}} & \texttt{Set} & \texttt{\#\{1 2 3\}}\\
\texttt{\{k v\}} & \texttt{Map} & \texttt{\{:name "Ada"\}}\\
\end{tabular}
\end{center}
\section{Type Expressions}
\label{sec:orga19db58}

In a dependently-typed language, types and terms share the same expression
syntax. This section highlights type-specific forms.
\subsection{Base Types}
\label{sec:org1642b5e}

\begin{verbatim}
base-type ::= 'Type'     (* universe of types, level inferred *)
            | 'Nat'      (* natural numbers                    *)
            | 'Int'      (* arbitrary-precision integers        *)
            | 'Rat'      (* exact rationals                     *)
            | 'Bool'     (* booleans                            *)
            | 'Unit'     (* unit type                           *)
            | 'Symbol'   (* symbols for homoiconicity           *)
            | 'Keyword'  (* keyword type for map keys           *)
            | 'Datum'    (* code-as-data algebraic type         *)
\end{verbatim}

\begin{verbatim}
def x : Nat zero
def b : Bool true
def u : Unit unit
\end{verbatim}
\subsection{Parameterized Types}
\label{sec:orgfeefba8}

Types are applied to arguments via juxtaposition in brackets:

\begin{verbatim}
List Nat            ;; list of natural numbers
Option Bool         ;; optional boolean
Map Keyword Int     ;; keyword-to-int map
Vec Nat 3N          ;; length-3 vector of Nats (dependent!)
Set Int             ;; set of ints
PVec Nat            ;; persistent vector of Nats
\end{verbatim}
\subsection{Function Types (Arrows)}
\label{sec:orgf2c2edd}

Arrows are right-associative infix operators:

\begin{verbatim}
arrow-type ::= type '->' type    (* unrestricted function *)
             | type '-0>' type   (* erased function       *)
             | type '-1>' type   (* linear function       *)
             | type '-w>' type   (* unrestricted, explicit *)
\end{verbatim}

\begin{verbatim}
Nat -> Nat                ;; simple function
Nat -> Nat -> Bool        ;; curried: Nat -> (Nat -> Bool)
[List A] -> Nat           ;; bracketed domain
[A -> B] -> [List A] -> List B  ;; higher-order
\end{verbatim}
\subsection{Dependent Types (Angle Brackets)}
\label{sec:org4a602a3}

Angle brackets delimit dependent Pi (universal) and Sigma (existential) types:

\begin{verbatim}
dependent-type ::= '<' '(' ident ':' type ')' '->' type '>'  (* dependent Pi   *)
                 | '<' '(' ident ':' type ')' '*'  type '>'  (* dependent Sigma *)
                 | '<' ident ':' type '->' type '>'           (* shorthand Pi   *)
\end{verbatim}

\begin{verbatim}
;; Dependent function: "for all n : Nat, a vector of length n"
<(n : Nat) -> Vec Nat n>

;; Dependent pair: "a natural n together with a Vec of that length"
<(n : Nat) * Vec Nat n>

;; Shorthand (single binder, no inner parens):
<n : Nat -> Vec Nat n>
\end{verbatim}
\subsection{Sigma Types (Product / Pair Types)}
\label{sec:org7d4874a}

Non-dependent pair types use infix \texttt{*}:

\begin{verbatim}
;; Non-dependent pair
Nat * Bool

;; In return type of split-at:
[Sigma [_ <List A>] [List A]]

;; Dependent Sigma via angle brackets:
<(x : Nat) * Vec Nat x>
\end{verbatim}
\subsection{Equality Type}
\label{sec:org354a16e}

\begin{verbatim}
;; Eq type : proof that two terms are equal
(Eq Nat zero zero)       ;; 0 = 0 at type Nat
(Eq Nat [add x y] [add y x])  ;; commutativity
\end{verbatim}
\subsection{Union Types}
\label{sec:org77bcd63}

Union types use infix \texttt{|}:

\begin{verbatim}
Nat | Bool         ;; either a Nat or a Bool
Int | Rat | Nat    ;; right-associative: Int | (Rat | Nat)
\end{verbatim}
\subsection{Universe Levels}
\label{sec:org3064313}

\begin{verbatim}
Type           ;; universe, level inferred
(Type 0)       ;; explicit level 0
(Type 1)       ;; explicit level 1 (contains Type 0)
\end{verbatim}
\subsection{Type Holes}
\label{sec:org60a6820}

The wildcard \texttt{\_} stands for an inferred type:

\begin{verbatim}
def x : _ zero    ;; type inferred as Nat
map _ xs          ;; type argument inferred
\end{verbatim}
\section{Expressions}
\label{sec:org015f17d}

\subsection{Function Application}
\label{sec:org2ddac0c}

Application is juxtaposition, with brackets \texttt{[]} for grouping:

\begin{verbatim}
;; Simple application
suc zero                    ;; suc(zero)

;; Multi-argument (uncurried convention)
add x y                     ;; add(x, y)

;; Brackets for grouping
[add x y]                   ;; same as add x y
cons [f a] [map f as]       ;; cons(f(a), map(f, as))

;; Nested application
map [add 1N _] '[1N 2N 3N]  ;; map with partial application
\end{verbatim}
