docs/spec/grammar.org
** Lambda Expressions

#+begin_src grammar
lambda ::= 'fn' binder+ body
         | '(' 'fn' '(' ident ':' type ')' body ')'   (* sexp mode *)
#+end_src

#+begin_src prologos
;; WS mode: fn with bracket binder
fn [x : Nat] [suc x]

;; Multiple binder groups
fn [x : Nat] [y : Nat] [add x y]

;; Bare parameter (type inferred from context)
fn x [suc x]

;; Sexp mode: explicit binder
(fn (x : Nat) (suc x))

;; With multiplicity annotation
(fn (x :1 Nat) x)          ;; linear lambda
(fn (x :0 Nat) zero)       ;; erased lambda (can't use x)
#+end_src

** Pattern Matching

=match= is the primary pattern matching form, using =|= for arm separation:

#+begin_src grammar
match-expr ::= 'match' scrutinee match-arm+
match-arm  ::= '|' pattern '->' body
#+end_src

#+begin_src prologos
;; Match on Nat
match n
  | zero  -> zero
  | suc k -> add k k

;; Match on Bool
match b
  | true  -> suc zero
  | false -> zero

;; Match on List
match xs
  | nil       -> zero
  | cons a as -> suc [length as]

;; Match on Option
match [find pred xs]
  | none   -> default
  | some v -> v

;; Nested match
match xs
  | nil       -> nil
  | cons a as -> match [pred a]
    | true  -> cons a [filter pred as]
    | false -> filter pred as
#+end_src

Available patterns:
- *Variable*: =x=, =n=, =rest= -- binds the matched value
- *Wildcard*: =_= -- matches anything, discards
- *Constructor*: =zero=, =suc k=, =nil=, =cons a as=, =true=, =false=,
  =none=, =some v=, =ok v=, =err e=, =datum-nil=, =datum-cons h t=, etc.
- *Nested*: =[cons x nil]= -- grouped pattern in brackets

** If (Conditional)

=if= is a macro that desugars to =match= on Bool:

#+begin_src prologos
;; Three-argument if
if [zero? n] base-case [step n]

;; Equivalent match:
match [zero? n]
  | true  -> base-case
  | false -> step n
#+end_src

** Let (Local Binding)

=let= is a macro that desugars to application:

#+begin_src prologos
;; Single binding
let x = [add 1N 2N]
  suc x

;; With type annotation
let x : Nat = [add 1N 2N]
  suc x
#+end_src

** Pipe Operator (|>)

The pipe operator threads a value left-to-right through functions:

#+begin_src prologos
;; Binary pipe
zero |> suc |> suc |> suc    ;; = suc(suc(suc(zero))) = 3

;; Block pipe with indented steps
|> nums
  map suc-fn
  filter is-positive
  reduce sum-rf zero

;; Block pipes support automatic loop fusion:
;; consecutive map/filter steps fuse into a single-pass
;; transducer when followed by a terminal (reduce, sum, etc.)
#+end_src

** Compose Operator (>>)

Left-to-right function composition:

#+begin_src prologos
;; Compose two functions
[suc >> suc] zero           ;; = suc(suc(zero)) = 2

;; Pipe into a composed function
zero |> [suc >> double]     ;; = double(suc(zero))
#+end_src

** Type Annotations (the)

Explicit type annotation on an expression:

#+begin_src prologos
;; Annotate with explicit type
(the Nat zero)
(the [List Nat] nil)
#+end_src

** Pairs

#+begin_src prologos
;; Construct a pair
pair 1N true

;; Project from a pair
first [pair 1N true]        ;; = 1N
second [pair 1N true]       ;; = true

;; Aliases: fst, snd
fst [pair x y]
snd [pair x y]
#+end_src

** Quote and Quasiquote

Quote ='= converts code to =Datum= (code-as-data):

#+begin_src prologos
'foo          ;; -> datum-sym
'42           ;; -> datum-nat
':hello       ;; -> datum-kw
'true         ;; -> datum-bool
'()           ;; -> datum-nil
'(add 1 2)   ;; -> datum-cons chain

;; Quasiquote with unquote
def val : Datum [datum-nat 10]
`,val          ;; splice val into template
`(add 1 ,val)  ;; template with hole
#+end_src

** Collection Literals

#+begin_src prologos
;; List literal (linked list)
'[1N 2N 3N]

;; List with tail
'[1N 2N | rest-list]

;; PVec (persistent vector)
@[1 2 3 4 5]

;; Set
#{1 2 3}

;; Lazy sequence
~[1 2 3]

;; Map (key-value pairs)
{:name "Ada" :age 36}
#+end_src

** Partial Application

Numbered placeholders =_1=, =_2= enable positional reordering:

#+begin_src prologos
;; Wildcard _ fills rightmost position
[add 1N _]           ;; fn x -> add 1N x

;; Numbered holes for reordering
[div _2 _1]          ;; fn x y -> div y x
#+end_src

** Varargs

The =...= marker in specs indicates variadic arguments. In =defn=, =...name=
collects excess arguments into a =List=:

#+begin_src prologos
spec sum-all Nat ... -> Nat
defn sum-all [...xs]
  sum xs

sum-all 1 2 3          ;; = 6
sum-all 1 2 3 4 5      ;; = 15

;; Mixed fixed + varargs
spec first-plus-rest Nat Nat ... -> Nat
defn first-plus-rest [first ...rest]
  add first [sum rest]

first-plus-rest 100 1 2 3  ;; = 106
#+end_src

* Declarations

