docs/spec/grammar.tex
\subsection{Lambda Expressions}
\label{sec:org9403515}

\begin{verbatim}
lambda ::= 'fn' binder+ body
         | '(' 'fn' '(' ident ':' type ')' body ')'   (* sexp mode *)
\end{verbatim}

\begin{verbatim}
;; WS mode: fn with bracket binder
fn [x : Nat] [suc x]

;; Multiple binder groups
fn [x : Nat] [y : Nat] [add x y]

;; Bare parameter (type inferred from context)
fn x [suc x]

;; Sexp mode: explicit binder
(fn (x : Nat) (suc x))

;; With multiplicity annotation
(fn (x :1 Nat) x)          ;; linear lambda
(fn (x :0 Nat) zero)       ;; erased lambda (can't use x)
\end{verbatim}
\subsection{Pattern Matching}
\label{sec:org2c96a4b}

\texttt{match} is the primary pattern matching form, using \texttt{|} for arm separation:

\begin{verbatim}
match-expr ::= 'match' scrutinee match-arm+
match-arm  ::= '|' pattern '->' body
\end{verbatim}

\begin{verbatim}
;; Match on Nat
match n
  | zero  -> zero
  | suc k -> add k k

;; Match on Bool
match b
  | true  -> suc zero
  | false -> zero

;; Match on List
match xs
  | nil       -> zero
  | cons a as -> suc [length as]

;; Match on Option
match [find pred xs]
  | none   -> default
  | some v -> v

;; Nested match
match xs
  | nil       -> nil
  | cons a as -> match [pred a]
    | true  -> cons a [filter pred as]
    | false -> filter pred as
\end{verbatim}

Available patterns:
\begin{itemize}
\item \textbf{Variable}: \texttt{x}, \texttt{n}, \texttt{rest} -- binds the matched value
\item \textbf{Wildcard}: \texttt{\_} -- matches anything, discards
\item \textbf{Constructor}: \texttt{zero}, \texttt{suc k}, \texttt{nil}, \texttt{cons a as}, \texttt{true}, \texttt{false},
\texttt{none}, \texttt{some v}, \texttt{ok v}, \texttt{err e}, \texttt{datum-nil}, \texttt{datum-cons h t}, etc.
\item \textbf{Nested}: \texttt{[cons x nil]} -- grouped pattern in brackets
\end{itemize}
\subsection{If (Conditional)}
\label{sec:orgd954990}

\texttt{if} is a macro that desugars to \texttt{match} on Bool:

\begin{verbatim}
;; Three-argument if
if [zero? n] base-case [step n]

;; Equivalent match:
match [zero? n]
  | true  -> base-case
  | false -> step n
\end{verbatim}
\subsection{Let (Local Binding)}
\label{sec:org4151f3e}

\texttt{let} is a macro that desugars to application:

\begin{verbatim}
;; Single binding
let x = [add 1N 2N]
  suc x

;; With type annotation
let x : Nat = [add 1N 2N]
  suc x
\end{verbatim}
\subsection{Pipe Operator (|>)}
\label{sec:orgc91349a}

The pipe operator threads a value left-to-right through functions:

\begin{verbatim}
;; Binary pipe
zero |> suc |> suc |> suc    ;; = suc(suc(suc(zero))) = 3

;; Block pipe with indented steps
|> nums
  map suc-fn
  filter is-positive
  reduce sum-rf zero

;; Block pipes support automatic loop fusion:
;; consecutive map/filter steps fuse into a single-pass
;; transducer when followed by a terminal (reduce, sum, etc.)
\end{verbatim}
\subsection{Compose Operator (>>)}
\label{sec:org1c7e682}

Left-to-right function composition:

\begin{verbatim}
;; Compose two functions
[suc >> suc] zero           ;; = suc(suc(zero)) = 2

;; Pipe into a composed function
zero |> [suc >> double]     ;; = double(suc(zero))
\end{verbatim}
\subsection{Type Annotations (the)}
\label{sec:orga2478d1}

Explicit type annotation on an expression:

\begin{verbatim}
;; Annotate with explicit type
(the Nat zero)
(the [List Nat] nil)
\end{verbatim}
\subsection{Pairs}
\label{sec:orgd43ac9b}

\begin{verbatim}
;; Construct a pair
pair 1N true

;; Project from a pair
first [pair 1N true]        ;; = 1N
second [pair 1N true]       ;; = true

;; Aliases: fst, snd
fst [pair x y]
snd [pair x y]
\end{verbatim}
\subsection{Quote and Quasiquote}
\label{sec:orge60734e}

Quote \texttt{'} converts code to \texttt{Datum} (code-as-data):

\begin{verbatim}
'foo          ;; -> datum-sym
'42           ;; -> datum-nat
':hello       ;; -> datum-kw
'true         ;; -> datum-bool
'()           ;; -> datum-nil
'(add 1 2)   ;; -> datum-cons chain

;; Quasiquote with unquote
def val : Datum [datum-nat 10]
`,val          ;; splice val into template
`(add 1 ,val)  ;; template with hole
\end{verbatim}
\subsection{Collection Literals}
\label{sec:org0bd7724}

\begin{verbatim}
;; List literal (linked list)
'[1N 2N 3N]

;; List with tail
'[1N 2N | rest-list]

;; PVec (persistent vector)
@[1 2 3 4 5]

;; Set
#{1 2 3}

;; Lazy sequence
~[1 2 3]

;; Map (key-value pairs)
{:name "Ada" :age 36}
\end{verbatim}
\subsection{Partial Application}
\label{sec:orgc29258c}

Numbered placeholders \texttt{\_1}, \texttt{\_2} enable positional reordering:

\begin{verbatim}
;; Wildcard _ fills rightmost position
[add 1N _]           ;; fn x -> add 1N x

;; Numbered holes for reordering
[div _2 _1]          ;; fn x y -> div y x
\end{verbatim}
\subsection{Varargs}
\label{sec:org652d614}

The \texttt{...} marker in specs indicates variadic arguments. In \texttt{defn}, \texttt{...name}
collects excess arguments into a \texttt{List}:

\begin{verbatim}
spec sum-all Nat ... -> Nat
defn sum-all [...xs]
  sum xs

sum-all 1 2 3          ;; = 6
sum-all 1 2 3 4 5      ;; = 15

;; Mixed fixed + varargs
spec first-plus-rest Nat Nat ... -> Nat
defn first-plus-rest [first ...rest]
  add first [sum rest]

first-plus-rest 100 1 2 3  ;; = 106
\end{verbatim}
