docs/spec/grammar.tex
\section{Declarations}
\label{sec:org4f5d03a}

\subsection{Namespace (ns)}
\label{sec:org910ea90}

Must be the first form in a file. Controls module identity and prelude loading:

\begin{verbatim}
;; Standard namespace: auto-imports prelude
ns my-project.utils

;; Bare namespace: no prelude
ns prologos.data.list :no-prelude
\end{verbatim}

The prelude automatically provides: \texttt{Nat}, \texttt{Bool}, \texttt{List}, \texttt{Option}, \texttt{Result},
\texttt{Pair} operations, \texttt{Eq=/=Ord=/=Add=/=Sub=/=Mul=/=Neg=/=Abs=/=FromInt=/=Num=/
=Fractional} traits and instances.
\subsection{Require}
\label{sec:org7bba36a}

Import modules with named or aliased references:

\begin{verbatim}
;; Named imports
require [prologos.data.list :refer [List nil cons map length]]

;; Aliased module
require [prologos.data.nat :as nat :refer [add mult]]

;; Multiple requires
require [prologos.data.list   :refer [List nil cons map]]
        [prologos.data.nat    :refer [add mult]]
        [prologos.data.option :refer [Option none some]]
\end{verbatim}
\subsection{Value Definition (def)}
\label{sec:org1ecb893}

\begin{verbatim}
;; With type annotation
def x : Nat zero

;; Shorthand with :=
def x := zero

;; Multi-line body (indented)
def nums : [List Nat]
  cons 1N [cons 2N [cons 3N [nil Nat]]]

;; Private (not auto-exported)
def- internal-state : Nat zero
\end{verbatim}
\subsection{Type Signature (spec)}
\label{sec:orgf2cdaae}

\texttt{spec} declares a type signature separately from the definition:

\begin{verbatim}
;; Simple function type
spec factorial Nat -> Nat

;; With implicit type parameters
spec map {A B : Type} [A -> B] [List A] -> List B

;; With trait constraints
spec elem {A : Type} [Eq A] A [List A] -> Bool

;; With varargs
spec sum-all Nat ... -> Nat

;; With multiple implicits and constraints
spec sort-on {A B : Type} [B -> B -> Bool] [A -> B] [List A] -> List A
\end{verbatim}
\subsection{Function Definition (defn)}
\label{sec:orga30a90b}

\begin{verbatim}
;; Basic function
spec add Nat -> Nat -> Nat
defn add [x y]
  match x
    | zero  -> y
    | suc n -> suc [add n y]

;; With inline type
defn suc-all [xs : List Nat] : List Nat
  map [add _ 1N] xs

;; With return type annotation
impl Eq Nat
  defn eq? [x y] <Bool>
    nat-eq? x y

;; Multi-arity with |
defn fact
  | [zero]  -> suc zero
  | [suc n] -> mult [suc n] [fact n]

;; Private
defn- helper [x]
  suc x
\end{verbatim}
\subsection{Algebraic Data Types (data)}
\label{sec:org5b7a29a}

\begin{verbatim}
;; Enumeration (nullary constructors)
data Bool
  true
  false

;; Parameterized with constructors
data List {A}
  nil
  cons : A -> List A

;; Multiple implicit params
data Either {A B}
  left  : A
  right : B

;; Single constructor (wrapper)
data Ordering
  lt-ord
  eq-ord
  gt-ord

;; Private data type
data- InternalTree {A}
  leaf
  node : A -> InternalTree A -> InternalTree A
\end{verbatim}
\subsection{Traits and Implementations}
\label{sec:org7cfedef}

\begin{verbatim}
;; Trait definition
trait Eq {A}
  eq? : A -> A -> Bool

;; Implementation
impl Eq Nat
  defn eq? [x y] <Bool>
    nat-eq? x y

;; Multi-method trait
trait Ord {A}
  compare : A -> A -> Ordering

;; Generic functions using trait dicts
spec eq-neq [Eq A] A A -> Bool
defn eq-neq [dict x y]
  not [dict x y]

;; Bundle: named trait combination
bundle Num := (Add, Sub, Mul, Neg, Abs, FromInt)
\end{verbatim}
\subsection{User-Defined Macros}
\label{sec:org115b86c}

\begin{verbatim}
;; Simple macro: double-it x --> add x x
defmacro double-it [$x] [add $x $x]

double-it 5             ;; = 10

;; Conditional macro
defmacro when-nonzero [$n $body]
  [if [not [zero? $n]] $body zero]

when-nonzero 5 [double 5]    ;; = 10
when-nonzero zero [double 5]  ;; = 0

;; Introspection
(expand (double-it 5))        ;; shows expansion
(expand-1 (double-it 5))      ;; one step
(expand-full (when true [suc zero]))  ;; all steps with labels
\end{verbatim}
\section{Multiplicity (QTT)}
\label{sec:orgb6c15eb}

Prologos uses Quantitative Type Theory for resource tracking. Each variable
binding has a \emph{multiplicity} annotation:

\begin{center}
\begin{tabular}{lll}
Annotation & Meaning & Syntax\\
\hline
\texttt{:0} & Erased (0 uses at runtime) & \texttt{(x :0 Nat)}\\
\texttt{:1} & Linear (exactly 1 use) & \texttt{(x :1 Nat)}\\
\texttt{:w} & Unrestricted (any uses) & \texttt{(x :w Nat)}\\
\end{tabular}
\end{center}

Arrow types carry multiplicities:

\begin{verbatim}
Nat -> Nat            ;; unrestricted (default :w)
Nat -0> Nat           ;; erased: argument not used at runtime
Nat -1> Nat           ;; linear: argument used exactly once
Nat -w> Nat           ;; unrestricted: explicit
\end{verbatim}

\begin{verbatim}
;; Erased argument (type-level only)
(fn (A :0 Type) (fn (x :w A) x))     ;; polymorphic identity

;; Linear function
(fn (x :1 Nat) x)                    ;; must use x exactly once
\end{verbatim}
\section{Dependent Types and Eliminators}
\label{sec:org1e41dbc}

\subsection{Natural Number Elimination (natrec)}
\label{sec:org3cd3924}

The low-level eliminator for natural numbers:

\begin{verbatim}
;; natrec motive base step target
;; motive : Nat -> Type
;; base   : motive zero
;; step   : (n : Nat) -> motive n -> motive (suc n)
;; target : Nat
natrec motive base step target
\end{verbatim}

In practice, \texttt{match} is preferred:

\begin{verbatim}
;; Idiomatic: match instead of natrec
defn double [n]
  match n
    | zero  -> zero
    | suc k -> suc [suc [double k]]
\end{verbatim}
