docs/spec/grammar.org
** Equality Elimination (J)

#+begin_src prologos
;; J motive base left right proof
;; Given proof : Eq A left right
;; J computes: motive(left, right, proof) via base(left)
J motive base left right refl
#+end_src

** Length-Indexed Vectors

#+begin_src prologos
;; Vec A n : a vector of exactly n elements of type A
;; Fin n   : a number guaranteed less than n

vnil Nat                         ;; empty: Vec Nat 0
vcons Nat 2N x xs                ;; cons:  Vec Nat 3 (given xs : Vec Nat 2)
vhead Nat 2N v                   ;; safe head (non-empty guaranteed)
vtail Nat 2N v                   ;; safe tail
vindex Nat 3N [fzero 2N] v      ;; safe index via Fin
#+end_src

* Full Program Example

A complete Prologos program demonstrating multiple features:

#+begin_src prologos
ns examples.demo

require [prologos.data.list   :refer [List nil cons map reduce sum length]]
        [prologos.data.nat    :refer [add mult]]
        [prologos.data.option :refer [Option none some]]

;; Type signature with implicit params
spec factorial Nat -> Nat
defn factorial [n]
  match n
    | zero  -> suc zero
    | suc k -> mult n [factorial k]

;; Higher-order function with trait constraint
spec sum-mapped {A : Type} [A -> Nat] [List A] -> Nat
defn sum-mapped [f xs]
  sum [map f xs]

;; Data type definition
data Tree {A}
  leaf
  node : A -> Tree A -> Tree A

;; Pattern matching on user-defined types
spec tree-size [Tree A] -> Nat
defn tree-size [t]
  match t
    | leaf       -> zero
    | node _ l r -> suc [add [tree-size l] [tree-size r]]

;; Using pipe operator
def result : Nat
  |> '[1N 2N 3N 4N 5N]
    map [add 1N _]
    reduce add 0N

;; Macro definition
defmacro unless [$cond $body] [if $cond zero $body]

;; Using the macro
unless [zero? 5] [factorial 5]
#+end_src

* Appendix: S-Expression Mode

Every WS-mode form has a canonical s-expression representation. In sexp mode,
all grouping uses parentheses and whitespace is not significant:

#+begin_src prologos
;; WS mode:
defn add [x y]
  match x
    | zero  -> y
    | suc n -> suc [add n y]

;; Equivalent sexp mode:
(defn add (x y)
  (match x
    (zero  -> y)
    (suc n -> (suc (add n y)))))

;; WS mode:
spec map {A B : Type} [A -> B] [List A] -> List B

;; Equivalent sexp mode:
(spec map {A B : Type} (-> (-> A B) (-> (List A) (List B))))
#+end_src

* Appendix: Whitespace Reader Rules

The WS reader converts indentation to explicit structure:

1. *Same indentation* as previous line: NEWLINE token (sibling separator)
2. *Deeper indentation*: INDENT token (child block begins)
3. *Shallower indentation*: DEDENT token(s) (child blocks end)
4. *Inside brackets* =[]=, =()=, ={}=, =<>=: newlines are whitespace
5. *Blank/comment lines*: ignored for indentation purposes
6. *Column 0*: always starts a new top-level form

* Appendix: Reader Desugaring Table

| Surface syntax  | Reader output            | Meaning                      |
|-----------------+--------------------------+------------------------------|
| ='expr=         | =($quote expr)=          | Quote to Datum               |
| =`expr=         | =($quasiquote expr)=     | Quasiquote template          |
| =,expr=         | =($unquote expr)=        | Unquote (splice into QQ)     |
| =42N=           | =($nat-literal 42)=      | Natural number literal       |
| =~42=           | =($approx-literal 42)=   | Approximate (Posit) literal  |
| =:name=         | =keyword token=          | Keyword literal              |
| ='[1 2 3]=      | =($list-literal 1 2 3)=  | List literal                 |
| =@[1 2 3]=      | =($vec-literal 1 2 3)=   | PVec literal                 |
| =~[1 2 3]=      | =($lseq-literal 1 2 3)=  | Lazy sequence literal        |
| =#{1 2 3}=      | =($set-literal 1 2 3)=   | Set literal                  |
| =...name=       | =($rest-param name)=     | Rest/vararg parameter        |
| =x \vert> f=    | =($pipe-gt x f)=         | Pipe left-to-right           |
| =f >> g=        | =($compose f g)=         | Compose left-to-right        |
