docs/spec/grammar.tex
\subsection{Equality Elimination (J)}
\label{sec:org7f8a886}

\begin{verbatim}
;; J motive base left right proof
;; Given proof : Eq A left right
;; J computes: motive(left, right, proof) via base(left)
J motive base left right refl
\end{verbatim}
\subsection{Length-Indexed Vectors}
\label{sec:org5633044}

\begin{verbatim}
;; Vec A n : a vector of exactly n elements of type A
;; Fin n   : a number guaranteed less than n

vnil Nat                         ;; empty: Vec Nat 0
vcons Nat 2N x xs                ;; cons:  Vec Nat 3 (given xs : Vec Nat 2)
vhead Nat 2N v                   ;; safe head (non-empty guaranteed)
vtail Nat 2N v                   ;; safe tail
vindex Nat 3N [fzero 2N] v      ;; safe index via Fin
\end{verbatim}
\section{Full Program Example}
\label{sec:org6ac7da7}

A complete Prologos program demonstrating multiple features:

\begin{verbatim}
ns examples.demo

require [prologos.data.list   :refer [List nil cons map reduce sum length]]
        [prologos.data.nat    :refer [add mult]]
        [prologos.data.option :refer [Option none some]]

;; Type signature with implicit params
spec factorial Nat -> Nat
defn factorial [n]
  match n
    | zero  -> suc zero
    | suc k -> mult n [factorial k]

;; Higher-order function with trait constraint
spec sum-mapped {A : Type} [A -> Nat] [List A] -> Nat
defn sum-mapped [f xs]
  sum [map f xs]

;; Data type definition
data Tree {A}
  leaf
  node : A -> Tree A -> Tree A

;; Pattern matching on user-defined types
spec tree-size [Tree A] -> Nat
defn tree-size [t]
  match t
    | leaf       -> zero
    | node _ l r -> suc [add [tree-size l] [tree-size r]]

;; Using pipe operator
def result : Nat
  |> '[1N 2N 3N 4N 5N]
    map [add 1N _]
    reduce add 0N

;; Macro definition
defmacro unless [$cond $body] [if $cond zero $body]

;; Using the macro
unless [zero? 5] [factorial 5]
\end{verbatim}
\section{Appendix: S-Expression Mode}
\label{sec:orgf9cdc54}

Every WS-mode form has a canonical s-expression representation. In sexp mode,
all grouping uses parentheses and whitespace is not significant:

\begin{verbatim}
;; WS mode:
defn add [x y]
  match x
    | zero  -> y
    | suc n -> suc [add n y]

;; Equivalent sexp mode:
(defn add (x y)
  (match x
    (zero  -> y)
    (suc n -> (suc (add n y)))))

;; WS mode:
spec map {A B : Type} [A -> B] [List A] -> List B

;; Equivalent sexp mode:
(spec map {A B : Type} (-> (-> A B) (-> (List A) (List B))))
\end{verbatim}
\section{Appendix: Whitespace Reader Rules}
\label{sec:orga422e1c}

The WS reader converts indentation to explicit structure:

\begin{enumerate}
\item \textbf{Same indentation} as previous line: NEWLINE token (sibling separator)
\item \textbf{Deeper indentation}: INDENT token (child block begins)
\item \textbf{Shallower indentation}: DEDENT token(s) (child blocks end)
\item \textbf{Inside brackets} \texttt{[]}, \texttt{()}, \texttt{\{\}}, \texttt{<>}: newlines are whitespace
\item \textbf{Blank/comment lines}: ignored for indentation purposes
\item \textbf{Column 0}: always starts a new top-level form
\end{enumerate}
\section{Appendix: Reader Desugaring Table}
\label{sec:orge410444}

\begin{center}
\begin{tabular}{lll}
Surface syntax & Reader output & Meaning\\
\hline
\texttt{'expr} & \texttt{(\$quote expr)} & Quote to Datum\\
\texttt{`expr} & \texttt{(\$quasiquote expr)} & Quasiquote template\\
\texttt{,expr} & \texttt{(\$unquote expr)} & Unquote (splice into QQ)\\
\texttt{42N} & \texttt{(\$nat-literal 42)} & Natural number literal\\
\texttt{\textasciitilde{}42} & \texttt{(\$approx-literal 42)} & Approximate (Posit) literal\\
\texttt{:name} & \texttt{keyword token} & Keyword literal\\
\texttt{'[1 2 3]} & \texttt{(\$list-literal 1 2 3)} & List literal\\
\texttt{@[1 2 3]} & \texttt{(\$vec-literal 1 2 3)} & PVec literal\\
\texttt{\textasciitilde{}[1 2 3]} & \texttt{(\$lseq-literal 1 2 3)} & Lazy sequence literal\\
\texttt{\#\{1 2 3\}} & \texttt{(\$set-literal 1 2 3)} & Set literal\\
\texttt{...name} & \texttt{(\$rest-param name)} & Rest/vararg parameter\\
\texttt{x \textbackslash{}vert> f} & \texttt{(\$pipe-gt x f)} & Pipe left-to-right\\
\texttt{f >{}>{} g} & \texttt{(\$compose f g)} & Compose left-to-right\\
\end{tabular}
\end{center}
\end{document}
